In [1]:
#Insert
import pandas as pd

In [5]:
var = pd.DataFrame(
    {
        "A" : [1,2,3,4,5],
        "B" : [6,7,8,9,10],
    }
)
var

   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [6]:
var.insert(1,"C",var["A"]*10)
var

   A   C   B
0  1  10   6
1  2  20   7
2  3  30   8
3  4  40   9
4  5  50  10

In [8]:
var.insert(3,"D",[11,12,13,14,15])
var

   A   C   B   D
0  1  10   6  11
1  2  20   7  12
2  3  30   8  13
3  4  40   9  14
4  5  50  10  15

In [9]:
var = pd.DataFrame(
    {
        "A" : [1,2,3,4,5],
        "B" : [6,7,8,9,10],
    }
)
var

   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [10]:
var["C"] = var["A"][:3]
var

   A   B    C
0  1   6  1.0
1  2   7  2.0
2  3   8  3.0
3  4   9  NaN
4  5  10  NaN

In [11]:
#Delete

In [12]:
var = pd.DataFrame(
    {
        "A" : [1,2,3,4,5],
        "B" : [6,7,8,9,10],
        "C" : [11,12,13,14,15],
    }
)
var

   A   B   C
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [13]:
var.pop('B')
var

   A   C
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15

In [14]:
del var["A"]
var

    C
0  11
1  12
2  13
3  14
4  15